{"_id":{"$oid":"5c4bd58ce7179a090e0a4e34"},"author":"Jaha Naeem Gitonga","title":"Stuck in Madrid","likes":1785,"content":"I was in Dakar, Senegal and desperately needed a ticket back to the states. The cheapest ticket that I found back was a $1200 one way and I jumped on it. Thing is I had to call American Airlines in order to book the flight. The first two legs of the flight were through Iberia (which I guess is a subsidiary of American Airlines) and the last was through American Airlines. I was to depart from Dakar at 10:45pm on Sunday 20 January 2019 and arrive in Atlanta on Monday 21 January 2019 at 7:40pm. The woman that assisted me in purchasing my ticket assured me that I was purchasing two tickets (my mother was traveling too) for the 10:45pm departure on Sunday—lie number one. Lie number two was that I would receive a confirmation email—I never did. After about an hour and me realizing that no confirmation email was coming I decided to lookup the ticket on American Arlines’ website. That’s when I discovered that I had in fact been scheduled for the 1:20pm flight out of Dakar the same Sunday. My first connecting flight had been changed from Lisbon to Madrid and now didn’t even have a departure time. I immediately called American Airlines and informed them of their mistake.  The first person I spoke to even after explaining what had happened took nearly 45 minutes to understand why I was upset at American Airlines error and after placing me on hold for 10 minutes, supposedly awaiting a supervisor to assist me, the call mysteriously dropped—no mystery they just wanted me to accept their mistake. And no one even called me back! I called back and got another person who wanted to ask me the same questions I had previously answered during the first hour long callback. I asked if there were any notes on my inquiry and of course there weren’t so I had to go through everything all over again with her. She seemed to have a better/quicker understanding than the first person and got me transferred to her supervisor a “Tony See”—if that was her real name. After explaining the situation to her she told me that she would either refund the money or try to schedule me on a later flight.  I wanted the original flight—the 10:45pm.  I explained to her that this would ruin my Sunday plans before leaving the country and cause me to have long layovers that were just unacceptable.  She was rude and unwilling to change the flight stating that they weren’t any seats left on the original one.  When asked why didn’t the person who booked it for me tell me that, of course there was no answer. She refused to offer me any compensation for their mistake. I asked for a bump in my ticket (first/business class) she told me that I would be responsible for paying the difference! WTH! I asked for a voucher, credit for a future flight and was denied everything. It got to a point where she would only offer a refund of the ticket and basically left me with a take it or leave it option with no respect that I had been the victim of an American Airlines employee error. Then while attempting to convince Tony See to right their wrong she places me on hold and what happens…the call drops again! Once again, no callback, no email, no nothing. I ended up having to spend the night in the Madrid airport along with my mother.  Luckily, I had enough money to get us into the VIP lounge where we were able to pass the night in moderate comfort.  This was my last time purchasing a ticket from American Airlines. I never knew they were such a low-down-sorry company that would not even attempt to correct their mistakes. They have the worst personnel also.  I wouldn’t recommend American Airlines to anyone. To the contrary, I created a website to urge everyone to spend their money elsewhere because it will be appreciated more elsewhere. Stay away from American Airlines, they are the worst! ended up having to keep the flight because I couldn’t find any other at a reasonable price and having to spend 16 hours in the Madrid airport waiting for my next flight.  I was so mad that I channeled this energy to make this website to make my voice heard and that of others as well."}
